
# Welcome to data visualization

Welcome to the Data Visualization tutorial!

Data visualization is one of the core skills in data science. In order to start building useful models, we need to understand the underlying dataset. You will never be an expert on the data you are working with, and will always need to explore the variables in great depth before you can move on to building a model or doing something else with the data. Effective data visualization is the most important tool in your arsenal for getting this done, and hence an critical skill for you to master.

In this tutorial series, we will cover building effective data visualizations in Python. We will cover the **pandas** and **seaborn** plotting tools in depth. We will also touch upon **matplotlib**, and discuss **plotly** and **plotnine** in later sections. We still start with simple single-variable plots and work our way up to plots showing two, three, or even more dimensions. Upon completing this tutorial you should be well-equipped to start doing useful exploratory data analysis (EDA) with your own datasets!

# Prerequisites

There's one thing to do before we get started, however: learn about **pandas**, the linchpin of the Python data science ecosystem. **pandas** contains all of the data reading, writing, and manipulation tools that you will need to probe your data, run your models, and of course, visualize. As a result, a working understanding of **pandas** is critical to being a sucessful builder of data visualizations.

If you are totally unfamiliar with **pandas**, the following prerequisites will cover just enough **pandas** to get you started. These tutorial sections are targetted at total beginners; if you are already at least mildly familiar with the library, you should skip ahead to the next section.

# Tutorial: Accessing Data with Pandas

This tutorial will walk you through the essentials of how to index & filter data with Pandas. Think of it as a greatly condensed, opinionated version of the [official indexing documentation](http://pandas.pydata.org/pandas-docs/stable/indexing.html#)

We'll start by loading Pandas and the data:

In [12]:
import pandas as pd #importing the pandas

In [13]:
df = pd.read_csv('parks.csv', index_col=['Park Code']) #reading the data/csv Files

In [14]:
df.head(3) # This Function will print first 3 Rows

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

### Indexing: Single Rows

The simplest way to access a row is to pass the row number to the .iloc method. Note that first row is zero, just like list indexes.

In [15]:
df.iloc[2]

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

The other main approach is to pass a value from your dataframe's index to the .loc method:

In [16]:
df.loc['BADL']

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

### Indexing: Multiple Rows
If we need multiple rows, we can pass in multiple index values. Note that this changes the order of the results!

In [17]:
df.loc[['BADL', 'ARCH', 'ACAD']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [18]:
df.iloc[[2, 1, 0]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

Slicing the dataframe just as if it were a list also works.

In [19]:
df[:3]

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [20]:
df[3:6]

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
BIBE,Big Bend National Park,TX,801163,29.25,-103.25
BISC,Biscayne National Park,FL,172924,25.65,-80.08
BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

### Indexing: Columns
We can access a subset of the columns in a dataframe by placing the list of columns in brackets like so:

In [21]:
df['State'].head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

You can also access a single column as if it were an attribute of the dataframe, but only if the name has no spaces, uses only basic characters, and doesn't share a name with a dataframe method. So, df.State works:

In [22]:
df.State.head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

but **df.Park Code** will fail as there's a space in the name:

In [23]:
df.Park Code

SyntaxError: invalid syntax (<ipython-input-23-49beb60e7bae>, line 1)

We can only access the 'Park Code' column by passing its name as a string in brackets, like **df['Park Code']**. I recommend either always using that approach or always converting your column names into a valid format as soon as you read in the data so that you don't have to mix the two methods. It's just a bit tidier.

It's a good practice to clean your column names to prevent this sort of error. I'll use a very short cleaning function here since the names don't have any odd characters. By convention, the names should also be converted to lower case. Pandas is case sensitive, so future calls to all of the columns will need to be updated.

In [25]:
df.columns = [col.replace(' ', '_').lower() for col in df.columns]
print(df.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

### Indexing: Columns and Rows
If we need to subset by both columns and rows, you can stack the commands we've already learned.

In [26]:
df[['state', 'acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

### Indexing: Scalar Values
As you may have noticed, everything we've tried so far returns a small dataframe or series. If you need a single value, simply pass in a single column and index value.

In [27]:
df.state.iloc[2]

'SD'

Note that you will get a different return type if you pass a single value in a list.

In [28]:
df.state.iloc[[2]]

Park Code
BADL    SD
Name: state, dtype: object

Selecting a Subset of the Data
The main method for subsetting data in Pandas is called [boolean indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing). First, let's take a look at what pandas does when we ask it to evaluate a boolean:

In [29]:
(df.state == 'UT').head(3)

Park Code
ACAD    False
ARCH     True
BADL    False
Name: state, dtype: bool

We get a series of the results of the boolean. Passing that series into a dataframe gives us the subset of the dataframe where the boolean evaluates to True.

In [30]:
df[df.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

Some of the logical operators are different:

* ~ replaces not
* | replaces or
* & replaces and <br>
If you have multiple arguments they'll need to be wrapped in parentheses. For example:

In [32]:
df[(df.latitude > 60) | (df.acres > 10**6)].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

You can also use more complicated expressions, including lambdas.

In [34]:
df[df['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

### Key Companion Methods: isin and isnull
These methods make it much easier and faster to perform some very common tasks. Suppose we wanted to find all parks on the West coast. isin makes that simple:

In [35]:
df[df.state.isin(['WA', 'OR', 'CA'])].head()

                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

Less Common Methods
Pandas offers many more indexing methods. You should probably stick to a few of them for the sake of keeping your code readable, but it's worth knowing they exist in case you need to read other people's code or have an unusual use case:

* There are other ways to slice data with brackets. For the sake of readability, please don't use of them.
* .at and .iat: like .loc and .iloc but much faster in exchange for only working on a single column and only returning a single result.
* .eval: fast evaluation of a limited set of simple operators. .query works by calling this.
* .ix: deprecated method that tried to determine if an index should be evaluated with .loc or .iloc. This led to a lot of subtle bugs! If you see this, you're looking at old code that won't work any more.
* .get: like .loc, but will return a default value if the key doesn't exist in the index. Only works on a single column/series.
* .lookup: Not recommended. It's in the documentation, but it's unclear if this is actually still supported.
* .mask: like boolean indexing, but returns a dataframe/series of the same size as the original and anywhere that the boolean evaluates to True is set to nan.
* .query: similar to boolean indexing. Faster for large dataframes. Only supports a restricted set of operations; don't use if you need isnull() or other dataframe methods.
* .take: equivalent to .iloc, but can operate on either rows or columns.
* .where: like boolean indexing, but returns a dataframe/series of the same size as the original and anywhere that the boolean evaluates to False is set to nan.
* Multi-indexing: potentially useful for small to mid sized heirarchical datasets. Slow on larger datasets.

[Click here](https://github.com/harshitahluwalia7895/Data_Visualisation/blob/master/Selecting%20and%20Filtering%20Data.ipynb) to get to next notebook which is based on the topic **Selecting and Filtering Data**